-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Июн 13 2024 г., 20:12
-- Версия сервера: 8.0.30
-- Версия PHP: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `museum`
--

-- --------------------------------------------------------

--
-- Структура таблицы `exhibits`
--

CREATE TABLE `exhibits` (
  `id` int NOT NULL,
  `name` varchar(50) NOT NULL,
  `description` text NOT NULL,
  `image` varchar(255) NOT NULL,
  `properties` json NOT NULL,
  `language` varchar(25) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Дамп данных таблицы `exhibits`
--

INSERT INTO `exhibits` (`id`, `name`, `description`, `image`, `properties`, `language`) VALUES
(1, 'Самшитовый гребень', 'Уникальная находка — самшитовый гребень XIII века с кириллическим алфавитом. Этот гребень является старейшим «учебником» грамотности в Беларуси и свидетельствует о высоком уровне культуры и письменности в Берестье.', 'ex1.png', '[\"XIII век\", \"дерево\", \"20 x 20 см\"]', 'RU'),
(2, 'Самшытавы грэбень', 'Унікальная знаходка - самшытавы грэбень XIII стагоддзя з кірылічным алфавітам. Гэты грэбень з\"яўляецца найстарэйшым» падручнікам \" пісьменнасці ў Беларусі і сведчыць пра высокі ўзровень культуры і пісьменства ў Бярэсці.', 'ex1.png', '[\"XIII стагоддзе\", \"дрэва\", \"20 х 20 см\"]', 'BY'),
(3, 'Фигурка короля', 'Под названием расположен текст, описывающий экспонат. Это высокохудожественное изделие из кости, созданное с особым вниманием к деталям и отделке. В тексте также упоминается, что в Беларуси было найдено 70 шахматных фигур, и только 4 из них, включая берестейского шахматного короля, представляют собой изобразительные шахматы с реалистичными чертами, а не абстрактными фигурами.', 'ex2.png', '[\"XIII век\", \"дерево\", \"20 х 20 см\"]', 'RU'),
(4, 'Биллоновый колт', 'Текст описывает уникальность и ценность колта как одного из наиболее дорогостоящих предметов в коллекции музея. Он был украшен символическим рисунком прорастающего зерна, и внутрь артефакта вкладывалась ткань, смоченная душистыми маслами.', 'ex3.png', '[\"XIII век\", \"дерево\", \"20 х 20 см\"]', 'RU'),
(5, 'Раковины каури', 'Среди предметов импортного происхождения выделяются раковины каури ХI–ХII вв., которые встречаются преимущественно в Индийском океане. Из них делали женские украшения или использовали как разменную монету.', 'ex4.png', '[\"XIII век\", \"дерево\", \"20 х 20 см\"]', 'RU'),
(6, 'Фігурка караля', 'Пад назвай размешчаны тэкст, які апісвае экспанат. Гэта высокамастацкае выраб з косці, створанае з асаблівай увагай да дэталяў і аздабленні. У тэксце таксама згадваецца, што ў Беларусі было знойдзена 70 шахматных фігур, і толькі 4 з іх, уключаючы Берасцейскага шахматнага караля, уяўляюць сабой выяўленчыя шахматы з рэалістычнымі рысамі, а не абстрактнымі фігурамі.', 'ex2.png', '[\"XIII век\", \"дерево\", \"20 х 20 см\"]', 'BY'),
(7, 'Білонавы колт', 'Тэкст апісвае ўнікальнасць і каштоўнасць колта як аднаго з найбольш дарагіх прадметаў у калекцыі музея. Ён быў упрыгожаны сімвалічным малюнкам прарастаючага збожжа, і ўнутр артэфакта ўкладвалася тканіна, змочаная духмянымі алеямі.', 'ex3.png', '[\"XIII век\", \"дерево\", \"20 х 20 см\"]', 'BY'),
(8, 'Ракавіны кауры', 'Сярод прадметаў імпартнага паходжання вылучаюцца ракавіны каўры ХІ-ХІІ стст., якія сустракаюцца пераважна ў Індыйскім акіяне. З іх рабілі жаночыя ўпрыгажэнні або выкарыстоўвалі як разменную манету.', 'ex4.png', '[\"XIII век\", \"дерево\", \"20 х 20 см\"]', 'BY');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `exhibits`
--
ALTER TABLE `exhibits`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `exhibits`
--
ALTER TABLE `exhibits`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
